Repository: vikram00014/Nyaya-Uday-App
Catalog: lib/l10n/app_*.arb
Languages: hi

# appTitle
source: Nyaya-Uday
hi: न्याय-उदय

# welcomeTitle
source: Welcome to Nyaya-Uday
hi: न्याय-उदय में आपका स्वागत है

# welcomeSubtitle
source: Your Path to the Bench Starts Here
hi: न्यायाधीश बनने की आपकी यात्रा यहाँ शुरू होती है

source: Get Started
hi: शुरू करें

# selectState
source: Select Your State
hi: अपना राज्य चुनें

# selectStateHint
source: Choose your home state
hi: अपना गृह राज्य चुनें

# selectEducation
source: Your Education Level
hi: आपका शिक्षा स्तर

# class10
source: Class 10th
hi: कक्षा 10वीं

# class12
source: Class 12th
hi: कक्षा 12वीं

source: Graduate
hi: स्नातक

# continueBtn
source: Continue
hi: आगे बढ़ें

# yourRoadmap
source: Your Judicial Career Roadmap
hi: आपका न्यायिक करियर रोडमैप

# juniorJudge
source: Junior Judge Simulation
hi: जूनियर जज सिमुलेशन

# trySimulation
source: Experience Thinking Like a Judge
hi: न्यायाधीश की तरह सोचने का अनुभव करें

source: Leaderboard
hi: लीडरबोर्ड

source: Profile
hi: प्रोफ़ाइल

source: Learn
hi: सीखें

source: Home
hi: होम

# whatIsJudge
source: What Does a Judge Do?
hi: न्यायाधीश क्या करते हैं?

# judgeRole
source: A judge listens to both sides, examines evidence, and makes fair decisions based on law.
hi: न्यायाधीश दोनों पक्षों को सुनते हैं, साक्ष्य की जांच करते हैं, और कानून के आधार पर निष्पक्ष निर्णय लेते हैं।

# aptitudeScore
source: Judicial Aptitude Score
hi: न्यायिक योग्यता स्कोर

source: Badges
hi: बैज

source: Rank
hi: रैंक

source: Case Scenarios
hi: केस परिदृश्य

# solveCases
source: Solve cases and earn points
hi: केस हल करें और अंक अर्जित करें

# makeJudgment
source: Make Your Judgment
hi: अपना फैसला दें

source: View Explanation
hi: व्याख्या देखें

source: Your Score
hi: आपका स्कोर

source: Fairness
hi: निष्पक्षता

source: Evidence-Based
hi: साक्ष्य-आधारित

source: Bias Avoidance
hi: पूर्वाग्रह से बचाव

source: Next Case
hi: अगला केस

source: Back to Home
hi: होम पर वापस

source: Language
hi: भाषा

# roadmapStep1Title
source: Complete Current Education
hi: वर्तमान शिक्षा पूर्ण करें

# roadmapStep2Title
source: Law Entrance Exam
hi: कानून प्रवेश परीक्षा

# roadmapStep3Title
source: Law Degree
hi: कानून की डिग्री

# roadmapStep4Title
source: Judicial Services Exam
hi: न्यायिक सेवा परीक्षा

# roadmapStep5Title
source: Become a Judge
hi: न्यायाधीश बनें

# yearsToComplete
source: {years} years
hi: {years} वर्ष

# askQuestion
source: Ask a question...
hi: प्रश्न पूछें...

source: Voice Assistant
hi: वॉइस सहायक

source: Legal Literacy
hi: कानूनी साक्षरता

# shortModules
source: Short 60-90 second modules
hi: छोटे 60-90 सेकंड के मॉड्यूल

source: Achievements
hi: उपलब्धियां

source: Total Score
hi: कुल स्कोर

source: Cases Completed
hi: पूर्ण किए गए केस

source: State Rank
hi: राज्य रैंक

source: National Rank
hi: राष्ट्रीय रैंक
